# Core System Tools
brew "coreutils"  # Install GNU core utilities (those that come with macOS are outdated).
brew "stow"       # Manages symlinks for dotfiles and configurations
brew "fisher"     # Fish plugin manager
brew "fish"       # Shell
brew "cmake"      # Manages project builds and generating makefiles
brew "pkg-config" # Manages compile and link flags for libraries
brew "gnupg"      # GNU Privacy Guard (GPG) for secure communication
brew "moreutils"  # Collection of additional Unix utilities (like sponge)
brew "findutils"  # GNU find, xargs, and locate, utilities for finding files
brew "gnu-sed"    # macOS uses the BSD version. I prefer the GNU one.
brew "gnu-tar"    # macOS uses the BSD version. I prefer the GNU one.
brew "grep"       # macOS uses the BSD version. I prefer the GNU one.
brew "blueutil"   # Command-line utility for managing Bluetooth devices
brew "zstd"       # Fast real-time compression algorithm

brew "koekeishiya/formulae/yabai" # Window manager
brew "jackielii/tap/skhd-zig" # Hotkey daemon for macOS

# Development Tools
brew "neovim"    # Vim-fork focused on extensibility and usability
brew "tree-sitter-cli"
brew "git"       # Distributed version control system
brew "git-lfs"   # Git extension for versioning large files
brew "gh"        # GitHub CLI
brew "git-delta" # Syntax-highlighting pager for git and diff output
brew "shfmt"     # Shell script formatter
brew "markdownlint-cli2"
brew "yamlfmt"

# Network and Security
brew "wget"    # Internet file retriever
brew "openssh" # Secure shell (ssh) and secure file transfer (sftp)
brew "ykman"   # YubiKey Manager CLI
# brew "autossh" # Automatically restart SSH sessions and tunnels
# brew "rclone"  # Rsync for cloud storage
# brew "MisterTea/et/et"    # Remote terminal application. Add steps to launch deamon if enabled

# Terminal Enhancement
brew "tmux"      # Terminal multiplexer
brew "starship"  # Shell prompt
brew "btop"      # Resource monitor
brew "bat"       # Cat clone with syntax highlighting and Git integration
brew "eza"       # Modern, maintained replacement for ls
brew "procs"     # Modern replacement for ps
brew "tailspin"  # Modern and fast log file viewer
brew "figlet"    # ASCII banner generator
brew "hyperfine" # Command-line benchmarking tool
brew "lolcrab"   # Like lolcat

# File Management and Search
brew "rename"  # Tool for batch renaming files
brew "zoxide"  # Smarter cd command for quick navigation
brew "ripgrep" # Fast text searching tool (replace to grep, ack)
brew "fzf"     # Command-line fuzzy finder
brew "fd"      # Simple, fast and user-friendly alternative to find
brew "fswatch" # Monitor a directory for changes
brew "watch"   # Executes a program periodically, showing output fullscreen
brew "dust"    # More intuitive version of du

# Media and File Processing
brew "ffmpeg"   # Multimedia framework
brew "p7zip"    # 7-Zip (file archiver with high compression ratio)
brew "aria2"    # Lightweight multi-protocol & multi-source command-line download utility
brew "exiftool" # Read, write and edit meta information in a wide variety of files
brew "yt-dlp"   # YouTube downloader

# System Management
brew "mas"       # Mac App Store command-line interface
brew "dockutil"  # Command-line tool for managing dock items

# Programming Languages and Package Managers
brew "python"          # Programming language
brew "uv"              # Tool for managing multiple runtime versions
brew "go"              # Programming language
brew "oven-sh/bun/bun" # JavaScript runtime and bundler
brew "fnm"             # Fast Node Manager
brew "rustup"          # Rust programming language
brew "openjdk"         # OpenJDK Java Development Kit
brew "luarocks"        # Lua package manager

# Cloud Tools
brew "awscli"           # Amazon Web Services command-line interface
brew "aws-sam-cli"      # AWS Serverless Application Model command-line interface

# Image and Font Processing
brew "sfnt2woff"   # Convert TrueType fonts to WOFF format
brew "woff2"       # WOFF 2.0 font compression
brew "imagemagick" # Image manipulation tools
brew "libmagic"    # File type identification library
brew "libavif"     # AVIF image format reference implementation
brew "webp"        # Image format that provides lossless and lossy compression for images on the web
brew "cairo"       # 2D graphics library with support for multiple output devices
brew "pango"       # Library for layout and rendering of text
brew "jpeg"        # Image manipulation library
brew "giflib"      # Library for reading and writing gif images
brew "librsvg"     # Library for rendering SVG files
brew "libvips"     # Image processing library
brew "perl"        # Programming language
brew "cpanm"       # Perl module installer
brew "latexindent" # Indentation of LaTeX documents
brew "font-sf-pro" # SF Pro font

# Web3 Development
brew "solidity"    # Ethereum smart contract language
brew "ethereum"    # Installs Ethereum and related tools
brew "stellar-cli" # Stellar CLI
brew "foundry"     # Ethereum development framework

cask "gcloud-cli" # Google Cloud command-line interface
cask "apparency"  # Inspect and manipulate app bundle

# Development Tools
cask "zed"                    # Code editor
cask "yaak"                   # API development environment
cask "http-toolkit"           # HTTP debugging proxy
cask "android-platform-tools" # Android SDK Platform-Tools
cask "kitty"                  # Terminal emulator

# Security and Privacy
cask "1password"     # Password manager
cask "1password-cli" # Command-line interface for 1Password
cask "nordvpn"       # VPN
cask "veracrypt"     # Disk encryption
cask "macfuse"       # File system integration

# Communication and Collaboration
cask "telegram"    # Messaging app
cask "discord"     # Messaging app
cask "whatsapp"    # Messaging app
cask "slack"       # Work Messaging app
cask "zoom"        # Work video conferencing
# cask "teamviewer"  # Remote desktop software
cask "camo-studio" # iPhone as webcam software

# Web Browsers
cask "brave-browser" # Web browser

# Design and Media
cask "figma"                # Collaborative interface design tool
cask "iina"                 # Media player
cask "obs"                  # Open Broadcaster Software
cask "obs-advanced-scene-switcher" # OBS Scene Switcher
cask "cleanshot"            # Screen capture tool
cask "adobe-creative-cloud" # Adobe Creative Cloud

# Development Infrastructure
cask "docker-desktop" # Containerization platform

# Productivity
cask "raycast" # Command palette for MacOS (replace to Alfred or Spotlight)
cask "notion"  # Note-taking app
cask "fliqlo"  # Clock screensavers
cask "claude"  # AI assistant
cask "claude-code"
cask "busycal"   # Calendar and task manager
cask "hammerspoon"   # Automation software

# Terminal and System
cask "hyperkey"          # Remap caps lock to hyper key
cask "jordanbaird-ice"   # ICE for managing menu bar apps

# Audio Tools
cask "focusrite-control-2" # Audio interface
cask "loopback"            # Audio routing software
cask "soundsource"         # Audio control software

# Fonts
cask "font-fira-code-nerd-font" # Monospaced font with programming ligatures and icons (used for terminal)
cask "font-monaspace-nerd-font" # Monospaced font with programming ligatures and icons (used for terminal)
cask "font-hack-nerd-font" # Monospaced font with programming ligatures and icons (used for terminal)
cask "font-fira-code" # Monospaced font with programming ligatures
cask "font-monaspace" # Monospaced font with programming ligatures

# Entertainment
cask "spotify" # Music streaming service
# cask "steam"   # Gaming platform

# Hardware Support
cask "displaylink" # DisplayLink Manager for USB monitors
cask "linearmouse" # Mouse handler

# File Management
cask "the-unarchiver" # Unpacks archive files

cask "anybar" # Status indicator for macOS

mas "PDFgear", id: 6469021132
mas "Xcode", id: 497799835
